spuggy0919/ESP32_tinyConsole/lib/Tinybasic/hardware-arduino-HTTP.h
void vgascale(int* x, int* y) {
	*y=*y*10/24;
}

void rgbcolor(int r, int g, int b) {
	short vga;
	if (r>191 || g>191 || b>191) vga=8; else vga=0;
	vga=vga+r/128+g/128*2+b/128*4;
	vga_graph_pen=fabgl::Color(vga);
}

void vgacolor(short c) { vga_graph_pen = fabgl::Color(c%16); }
void plot(int x, int y) { 
	vgascale(&x, &y);
	cv.setPenColor(vga_graph_pen);
	cv.setPixel(x,y);
	cv.setPenColor(vga_txt_pen);
}
void line(int x0, int y0, int x1, int y1) {
	vgascale(&x0, &y0);
	vgascale(&x1, &y1);
	cv.setPenColor(vga_graph_pen);
	cv.setPenWidth(1);
 	cv.drawLine(x0, y0, x1, y1);
 	cv.setPenColor(vga_txt_pen);
}
void rect(int x0, int y0, int x1, int y1) { 
	vgascale(&x0, &y0);
	vgascale(&x1, &y1);
	cv.setPenColor(vga_graph_pen);
	cv.setPenWidth(1);
	cv.drawRectangle(x0, y0, x1, y1);
	cv.setPenColor(vga_txt_pen);
}
void frect(int x0, int y0, int x1, int y1) {  
	vgascale(&x0, &y0);
	vgascale(&x1, &y1);
	cv.setBrushColor(vga_graph_pen);
	cv.fillRectangle(x0, y0, x1, y1);
	cv.setBrushColor(vga_txt_pen);
}
void circle(int x0, int y0, int r) {  
	int rx = r;
	int ry = r;
	vgascale(&x0, &y0);
	vgascale(&rx, &ry);
	cv.setPenColor(vga_graph_pen);
	cv.setPenWidth(1);
	cv.drawEllipse(x0, y0, rx, ry);
	cv.setPenColor(vga_txt_pen);
}
void fcircle(int x0, int y0, int r) {  
	int rx = r;
	int ry = r;
	vgascale(&x0, &y0);
	vgascale(&rx, &ry);
	cv.setBrushColor(vga_graph_pen);
	cv.fillEllipse(x0, y0, rx, ry);
	cv.setBrushColor(vga_txt_pen);	
}
void vgawrite(char c){
	switch(c) {
    case 12: /* form feed is clear screen */
  		Terminal.write(27); Terminal.write('H');
    	Terminal.write(27); Terminal.write('J');
      return;
    case 10: /* this is LF Unix style doing also a CR */
      Terminal.write(10); Terminal.write(13);
    	return;
  	}
  	Terminal.write(c);
}

#endif

/* 
 * spuggy0919
 * this is the VGA code for httpwsVGA - experimental
 * give a websocket protocol for drawing functions
 */
#if defined(HTTPWSVGA)
#include "audiovideo.h"
int vga_graph_pen=0;
int vga_graph_pen_width=1;
int vga_graph_brush = 0x000000;
int vga_txt_pen = 0x00ff00;
int vga_txt_background = 0x000000;
unsigned int vga_pallete[16]={
	0x000000,
	0x800000,
	0x008000,
	0x808000,
	0x000080,
	0x800080,
	0x008080,
	0xc0c0c0,
	0x808080,
	0xFF0000,
	0x00ff00,
	0xFFff00,
	0x0000ff,
	0xFf00ff,
	0x00ffff,
	0xFFffff
};



/* this starts the vga controller and the terminal right now */
void vgabegin() {
	vga_graph_pen=0x000000;
}

int vgastat(char c) {return 0; }

void vgascale(int* x, int* y) {
	*y=*y*10/24;
}

void rgbcolor(int r, int g, int b) {
	vga_graph_pen=(r<<24)|(g<<16)|(b<<8)|0xFF;
}
void rgbacolor( int r, int g, int b, int a) { /*spuggy0919*/
	vga_graph_pen=(r<<24)|(g<<16)|(b<<8)|(a);
}
int setPenColor(int color){
	vga_graph_pen = color;
	return 0;
}
int setPenWidth(int w){
	vga_graph_pen_width = w;
	return 0;
}
void vgacolor(short c) { vga_graph_pen = (vga_pallete[c%16]<<8)|0xff;}
void plot(int x, int y) { 
		drawPenColor(vga_graph_pen);
		drawPixel( x, y);
		drawPenColor(vga_txt_pen);

}
void line(int x0, int y0, int x1, int y1) {
		drawPenColor(vga_graph_pen);
		drawLine(x0, y0, x1, y1);
		drawPenColor(vga_txt_pen);

}
void rect(int x0, int y0, int x1, int y1) { 
		drawPenColor(vga_graph_pen);
	    drawRect(x0, y0, x1, y1);
			drawPenColor(vga_txt_pen);

}
void frect(int x0, int y0, int x1, int y1) {  
		Serial.printf("Frect%d %d %d %d\n",x0,y0,x1,y1);
		drawPenColor(vga_graph_pen);
	    drawFRect(x0, y0, x1, y1);
		drawPenColor(vga_txt_pen);

}
void circle(int x0, int y0, int r) {  
		drawPenColor(vga_graph_pen);
	    drawCircle(x0, y0, r);
		drawPenColor(vga_txt_pen);

}
void fcircle(int x0, int y0, int r) {  
		drawPenColor(vga_graph_pen);
	    drawFCircle(x0, y0, r);
		drawPenColor(vga_txt_pen);
}
void vgawrite(char c){
	drawPenColor(vga_graph_pen);
	drawStrokeWidth(1);
	switch(c) {
    case 12: /* form feed is clear screen */
	    drawClearScr();
      return;
    case 10: /* this is LF Unix style doing also a CR */
        // Terminal.write(10); Terminal.write(13);
			drawChar(0xa);
			drawChar(0xd);
    	return;
  	}
	drawChar(c);
}
#else 
void vgabegin(){}
int vgastat(char c) {return 0; }
void vgawrite(char c){}
#endif

/* 
 * Keyboard code for either the Fablib Terminal class or 
 * PS2Keyboard - please note that you need the ESP patched 
 * version here as mentioned above
 * 
 * sets HASKEYBOARD to inform basic about this capability
 * 
 * keyboards can implement 
 * 	kbdbegin()
 * they need to provide
 * 	kbdavailable(), kbdread(), kbdcheckch()
 * the later is for interrupting running BASIC code
 */
#ifdef ARDUINO_TTGO_T7_V14_Mini32
#define PS2FABLIB
#define HASKEYBOARD
fabgl::PS2Controller PS2Controller;
char fabgllastchar = 0;
#else
#if defined(ARDUINO) && defined(ARDUINOPS2)
#define PS2KEYBOARD
#define HASKEYBOARD
PS2Keyboard keyboard;
#else 
#if defined(ARDUINO) && defined(ARDUINOUSBKBD)
#define HASKEYBOARD
#define USBKEYBOARD
USBHost usb;
KeyboardController keyboard(usb);
char usbkey=0;
#endif
#endif
#endif

#if defined(ARDUINOUSBKBD)
void keyPressed() {}
void keyReleased() {
  switch (keyboard.getOemKey()) {
    case 40:
      usbkey=10;
      break;
    case 42:
    case 76:
      usbkey=127;
      break;
    case 41:
      usbkey=27;
      break;
    default:
      usbkey=keyboard.getKey(); 
  }
}
#endif


void kbdbegin() {
#ifdef PS2KEYBOARD
	keyboard.begin(PS2DATAPIN, PS2IRQPIN, PS2Keymap_German);
#else
#ifdef PS2FABLIB
	PS2Controller.begin(PS2Preset::KeyboardPort0);
	PS2Controller.keyboard()->setLayout(&fabgl::GermanLayout);
#else 
#ifdef USBKEYBOARD
/* nothing to be done here */
#endif
#endif
#endif
}

int kbdstat(char c) {return 0; }

char kbdavailable(){
#ifdef PS2KEYBOARD
	return keyboard.available();
#else
#ifdef PS2FABLIB
  if (fabgllastchar) return Terminal.available()+1; else return Terminal.available();
#else 
#ifdef USBKEYBOARD
/* if we already have a key, tell the caller we have one */
  if (usbkey) return 1; 
/* if not, look it up */
  if (usbkey) return 1; else return 0;
#endif
#endif
#endif
#ifdef HASKEYPAD
	return keypadread()!=0;
#endif	
	return 0;
}

