spuggy0919/ESP32_tinyConsole/lib/Tinybasic/hardware-arduino-HTTP.h
char kbdread() {
	char c;
	while(!kbdavailable()) byield();
#ifdef PS2KEYBOARD	
	c=keyboard.read();
#endif
#ifdef PS2FABLIB
  if (fabgllastchar) { c=fabgllastchar; fabgllastchar=0; }
  else c=Terminal.read();
#else 
#ifdef USBKEYBOARD
/* if we have read a key before, return it else look it up */
  c=usbkey; 
  usbkey=0; 
#endif
#endif
#ifdef HASKEYPAD
	c=keypadread();
/* on a keypad wait for key release and then some more */
	while(kbdavailable()) byield();
  delay(100);
#endif	
	if (c == 13) c=10;
	return c;
}

char kbdcheckch() {
char c;
#ifdef PS2KEYBOARD
/*
 * only works with the patched library https://github.com/slviajero/PS2Keyboard
 */
#ifdef PS2KEYBOARD_HASPEEK
 return keyboard.peek();
#else 
/*
 * for the original library  https://github.com/PaulStoffregen/PS2Keyboard 
 * GET does not work properly with it as there is no peek functionality which is needed
 * for non blocking IO and the ability to stop programs
 */
  if (kbdavailable()) return kbdread();
#endif
#else
#ifdef PS2FABLIB
  if (fabgllastchar) return fabgllastchar;
	if (kbdavailable()) { fabgllastchar=Terminal.read(); return fabgllastchar; }
#else 
#ifdef USBKEYBOARD
  return usbkey;
#endif
#endif
#endif
#ifdef HASKEYPAD
	return keypadread();
#endif	
	return 0;
}

/*
 * this is a generic display code 
 * it combines the functions of LCD and TFT drivers
 * if this code is active 
 *
 * dspprintchar(char c, short col, short row)
 * dspclear()
 * spbegin()
 *
 * have to be defined before in a hardware dependent section.
 *
 * VGA systems don't use the display driver for text based output.
 *
 * The display driver exists as a buffered version that can scroll
 * or an unbuffered version that cannot scroll. Interfaces to hardware
 * scrolling are not yet implemented.
 * 
 * dspupdatemode controls the page update behaviour 
 *    0: character mode, display each character separately
 *    1: line mode, update the display after each line
 *    2: page mode, update the display after a ETX
 * ignored if the display has no update function
 *
 */

#ifdef DISPLAYDRIVER
short dspmycol = 0;
short dspmyrow = 0;
char esc = 0;
char dspupdatemode = 0;

int dspstat(char c) {return 0; }

void dspsetcursor(short c, short r) {
	dspmyrow=r;
	dspmycol=c;
}

char dspactive() {
	return od == ODSP;
}

/*
 * control the update modes for page update displays
 * like Epaper, Nokia 5110 and SSD1306
 * dspgraphupdate is the helper for the graphics functions
 */

void dspsetupdatemode(char c) {
  dspupdatemode=c;
}

char dspgetupdatemode() {
  return dspupdatemode;
}

void dspgraphupdate() {
  if (dspupdatemode == 0) dspupdate();
}

/* 
 * This is the minimalistic VT52 state engine. It is an interface to 
 * process single byte control sequences of the form <ESC> char 
 *
 * It is planned to implement an interface to the wiring, graphics,
 * and print library here.
 */

#ifdef HASVT52
/* the state variables, and modes */
char vt52s = 0;
enum vt52modes {vt52text, vt52graph, vt52print, vt52wiring} vt52mode = vt52text;

/* vt52 state engine */
void dspvt52(char* c){

/* reading and processing multi byte commands */
	switch (vt52s) {
		case 'Y':
			if (esc == 2) { dspmyrow=(*c-31)%dsp_rows; esc=1; return;}
			if (esc == 1) { dspmycol=(*c-31)%dsp_columns; *c=0; }
      vt52s=0; 
			break;
		case 'x':
			switch(*c) {
				case 'p':
					vt52mode=vt52print;
					break;
				case 'w':
					vt52mode=vt52wiring;
					break;
				case 'g':
					vt52mode=vt52graph;
				case 't':
				default:
					vt52mode=vt52text;
					break;
			}
			*c=0;
			vt52s=0;
			break;
	}
 
/* commands of the terminal in text mode */
	switch (*c) {
		case 'A': /* cursor up */
			if (dspmyrow>0) dspmyrow--;
			break;
		case 'B': /* cursor down */
			dspmyrow=(dspmyrow++) % dsp_rows;
			break;
		case 'C': /* cursor right */
			dspmycol=(dspmycol++) % dsp_columns;
			break; 
		case 'D': /* cursor left */
			if (dspmycol>0) dspmycol--;
			break;
		case 'E': /* GEMDOS / TOS extension clear screen */
			dspbufferclear();
			dspclear();
			break;
		case 'H': /* cursor home */
			dspmyrow=0;
   		dspmycol=0;
			break;	
		case 'Y': /* Set cursor position */
			vt52s='Y';
			esc=2;
  		*c=0;
			return;

/* these standard VT52 function and their GEMDOS extensions are
		not implemented. */ 
		case 'F': // enter graphics mode
		case 'G': // exit graphics mode
		case 'I': // reverse line feed
		case 'J': // clear to end of screen
		case 'K': // clear to end of line
		case 'L': // Insert line
		case 'M': // Delete line
		case 'Z': // Ident
		case '=': // alternate keypad on
		case '>': // alternate keypad off
		case 'b': // GEMDOS / TOS extension text color
		case 'c': // GEMDOS / TOS extension background color
		case 'd': // GEMDOS / TOS extension clear to start of screen
		case 'e': // GEMDOS / TOS extension enable cursor
		case 'f': // GEMDOS / TOS extension disable cursor
		case 'j': // GEMDOS / TOS extension restore cursor
		case 'k': // GEMDOS / TOS extension save cursor
		case 'l': // GEMDOS / TOS extension clear line
		case 'o': // GEMDOS / TOS extension clear to start of line		
		case 'p': // GEMDOS / TOS extension reverse video
		case 'q': // GEMDOS / TOS extension normal video
		case 'v': // GEMDOS / TOS extension enable wrap
		case 'w': // GEMDOS / TOS extension disable wrap
		case '^': // Printer extensions - print on
		case '_': // Printer extensions - print off
		case 'W': // Printer extensions - print without display on
		case 'X': // Printer extensions - print without display off
		case 'V': // Printer extensions - print cursor line
		case ']': // Printer extension - print screen 
			break;
/* the Arduino interface extensions defined in IoT BASIC
		access to some functions of BASIC through escape sequences */
		case 'x':
			vt52s='x';
			*c=0; 
			break;
	}
	esc=0;
	*c=0;
}
#endif


/* scrollable displays need a character buffer */
#ifdef DISPLAYCANSCROLL
char dspbuffer[dsp_rows][dsp_columns];
char dspscrollmode = 0;
short dsp_scroll_rows = 1; 

/* 0 normal scroll, 1 enable waitonscroll function */
void dspsetscrollmode(char c, short l) {
	dspscrollmode = c;
	dsp_scroll_rows = l;
}

/* clear the buffer */
void dspbufferclear() {
	short r,c;
	for (r=0; r<dsp_rows; r++)
		for (c=0; c<dsp_columns; c++)
      dspbuffer[r][c]=0;
  dspmyrow=0;
  dspmycol=0;
}

/* do the scroll */
void dspscroll(){
	short r,c;
	int i;
  char a,b;
  	
/* scroll data up and redraw the display */
  for (r=0; r<dsp_rows-dsp_scroll_rows; r++) { 
    for (c=0; c<dsp_columns; c++) {
			a=dspbuffer[r][c];
			b=dspbuffer[r+dsp_scroll_rows][c];
			if ( a != b ) {
  			if (b >= 32) dspprintchar(b, c, r); else dspprintchar(' ', c, r);
      }      
			dspbuffer[r][c]=b;
		} 
	}

/* delete the characters in the remaining lines */
	for (r=dsp_rows-dsp_scroll_rows; r<dsp_rows; r++) {
		for (c=0; c<dsp_columns; c++) {
			if (dspbuffer[r][c] > 32) dspprintchar(' ', c, r); 
			dspbuffer[r][c]=0;     
    }
	}
  
/* set the cursor to the fist free line	*/ 
  dspmycol=0;
	dspmyrow=dsp_rows-dsp_scroll_rows;
}

