spuggy0919/ESP32_tinyConsole/lib/Tinybasic/hardware-arduino-HTTP.h
/* 
 *	the wrappers of the arduino io functions, to avoid 
 */	
/* not needed in ESP32 2.0.2 core any more 
#ifdef ARDUINO_ARCH_ESP32
void analogWrite(int a, int b){}
#endif
*/

void aread(){ push(analogRead(pop())); }

void dread(){ push(digitalRead(pop())); }

void awrite(number_t p, number_t v){
	if (v >= 0 && v<256) analogWrite(p, v);
	else error(EORANGE);
}

void dwrite(number_t p, number_t v){
	if (v == 0) digitalWrite(p, LOW);
	else if (v == 1) digitalWrite(p, HIGH);
	else error(EORANGE);
}

/* we normalize the pinMode as ESP32, ESP8266, and other boards behave rather
 *  differently. Following Arduino conventions we map 0 always to INPUT  
 *  and 1 always to OUTPUT, all the other numbers are passed through to the HAL 
 *  layer of the platform.
 *  Example: OUTPUT on ESP32 is 3 and 1 is assigned to INPUT.
 */
void pinm(number_t p, number_t m){
  if (m == 0) m=INPUT; else if (m == 1) m=OUTPUT;
	pinMode(p, m);
}

void bmillis() {
	number_t m;
/* millis is processed as integer and is cyclic mod maxnumber and not cast to float!! */
	m=(number_t) (millis()/(unsigned long)pop() % (unsigned long)maxnum);
	push(m); 
};

void bpulsein() { 
  unsigned long t, pt;
  t=((unsigned long) pop())*1000;
  y=pop(); 
  x=pop(); 
  pt=pulseIn(x, y, t)/10; 
  push(pt);
}

void btone(short a) {
  number_t d = 0;
  number_t v = 100;
  if (a == 4) v=pop();
  if (a >= 3) d=pop();
	x=pop();
	y=pop();
#if defined(ARDUINO_ARCH_SAM) || defined(ARDUINO_ARCH_ESP32)
#if defined(ARDUINO_TTGO_T7_V14_Mini32) 
/* fabGL soundgenerator code of suggestes by testerrossa
 * pin numbers below 128 are real arduino pins while 
 * pin numvers from 128 onwards are sound generator capabilities
 * this is different from the original code
 * 
 * Sound generator capabilities are numbered as follows
 * 128: Sine wave 
 * 129: Symmetric square wave 
 * 130: Sawtooth
 * 131: Triangle
 * 132: VIC noise
 * 133: noise
 *
 * 256-511: square wave with variable duty cycle
 * 
 */
  if (x == 0) {
    soundGenerator.play(false);
    soundGenerator.clear();
    return;
  } 
  if (a == 2) d=60000;
  if (y == 128) soundGenerator.playSound(SineWaveformGenerator(), x, d, v); 
  if (y == 129) soundGenerator.playSound(SquareWaveformGenerator(), x, d, v);
  if (y == 130) soundGenerator.playSound(SawtoothWaveformGenerator(), x, d, v);
  if (y == 131) soundGenerator.playSound(TriangleWaveformGenerator(), x, d, v); 
  if (y == 132) soundGenerator.playSound(VICNoiseGenerator(), x, d, v);
  if (y == 133) soundGenerator.playSound(NoiseWaveformGenerator(), x, d, v);
  if (y >= 255 && y < 512 ) {
      y=y-255;
      SquareWaveformGenerator sqw;
      sqw.setDutyCycle(y);
      soundGenerator.playSound(sqw, x, d, v); 
  }
#else
	return;
#endif
#else 
  if (x == 0) {
    noTone(y);
  } else if (a == 2) {
		tone(y, x);
	} else {
		tone(y, x, d);
	}
#endif	
}

/* 
 *	the byield function is called after every statement
 *	it allows two levels of background tasks. 
 *
 *	ARDUINOBGTASK controls if time for background tasks is 
 * 	needed, usually set by hardware features
 *
 * 	YIELDINTERVAL by default is 32, generating a 32 ms call
 *		to the network loop function. YIELDTIME is 2 generating
 *		a 2 ms wait after the network loop to allow for buffer 
 * 		clearing after - this is needed on ESP8266
 *
 * 	LONGYIELDINTERVAL by default is 1000, generating a one second
 *		call to maintenance functions.
 *
 *	On an ESP8266 byield() is called every 100 microseconds
 *	(after each statement) in RUN mode. BASIC DELAY calls 
 * 	this every YIELDTIME ms. 
 */
void byield() {	
#if defined(ARDUINOBGTASK)
	if (millis()-lastyield > YIELDINTERVAL-1) {
		yieldfunction();
		lastyield=millis();
		delay(YIELDTIME);
  }
  if (millis()-lastlongyield > LONGYIELDINTERVAL-1) {
  	longyieldfunction();
  	lastlongyield=millis();
  }
#endif
  delay(0);
}

/* everything that needs to be done often - 32 ms */
void yieldfunction() {
#ifdef ARDUINOMQTT
	bmqtt.loop();
#endif
#ifdef ARDUINOUSBKBD
  usb.Task();
#endif
#ifdef HTTPWSSERIAL
   yield();
#endif
}

/* everything that needs to be done not so often - 1 second */
void longyieldfunction() {
#ifdef ARDUINOETH
  Ethernet.maintain();
#endif 
}

/* 
 *	The file system driver - all methods needed to support BASIC fs access
 * 	Different filesystems need different prefixes and fs objects, these 
 * 	filesystems use the stream API
 */
#if defined(ARDUINOSD) || defined(ESPSPIFFS) || defined(ESPLITTLEFS) /*spuggy0919***/
File ifile;
File ofile;
char tempname[SBUFSIZE];
#ifdef ARDUINOSD
File root;
File file;
#ifdef ARDUINO_ARCH_ESP32
const char rootfsprefix[2] = "/";
#else
const char rootfsprefix[1] = "";
#endif
#endif
#if defined(ESPSPIFFS) || defined(ESPLITTLEFS) /*spuggy0919***/
const char rootfsprefix[8] = "/basic/"; /*spuggy0919***/
#ifdef ARDUINO_ARCH_ESP8266 /*spuggy0919***/
Dir root;
File file;
#endif
#ifdef ARDUINO_ARCH_ESP32
File root;
File file;
#endif
#endif
#ifdef ARDUINO_ARCH_ESP8266
#define FILE_OWRITE (sdfat::O_READ | sdfat::O_WRITE | sdfat::O_CREAT | sdfat::O_TRUNC)
#else 
#ifdef ARDUINO_ARCH_ESP32
#define FILE_OWRITE FILE_WRITE
#else 
#define FILE_OWRITE (O_READ | O_WRITE | O_CREAT | O_TRUNC)
#endif
#endif
#endif

/* using the POSIX API in LittleFS */
#ifdef RP2040LITTLEFS
#define FILESYSTEMDRIVER
FILE* ifile;
FILE* ofile;
DIR* root;
struct dirent* file;
LittleFS_MBED *myFS;
const char rootfsprefix[10] = MBED_LITTLEFS_FILE_PREFIX;
#endif

/* use EEPROM as filesystem */
#ifdef ARDUINOEFS
byte ifile;
byte ofile;
byte file;
#endif

/* these filesystems have a path prefix */
#if defined(RP2040LITTLEFS) || defined(ESPSPIFFS) || defined(ARDUINOSD) || defined(ESPLITTLEFS)  /*spuggy0919*/
char tmpfilename[10+SBUFSIZE];

/* add the prefix to the filename */
char* mkfilename(const char* filename) {
	short i,j;
	Serial.printf("mkfilename=%s,%s", filename, tmpfilename); /*spuggy0919*/

	for(i=0; i<10 && rootfsprefix[i]!=0; i++) tmpfilename[i]=rootfsprefix[i];
    // tmpfilename[i++]='/'; /*spuggy0919 double "//" found */
	for(j=0; j<SBUFSIZE && filename[j]!=0; j++) tmpfilename[i++]=filename[j];
	tmpfilename[i]=0;
		Serial.printf("mkfilename=%s",tmpfilename); /*spuggy0919*/

