spuggy0919/ESP32_tinyConsole/lib/Tinybasic/hardware-arduino-HTTP.h
	return tmpfilename;
}

/* remove the prefix from the filename */
const char* rmrootfsprefix(const char* filename) {
	short i=0; 
	// return &filename[i];
	// Serial.printf("rmrootfsprefix=%s,%s",rootfsprefix,filename); /*spuggy0919*/

	while (rootfsprefix[i] !=0 && filename[i] !=0   ) {
        // Serial.printf("c comp=%c,%c",rootfsprefix[i],filename[i]); /*spuggy0919*/

		if ( filename[i] == rootfsprefix[i])i++;
		else{
			if (filename[i]=='/') i++;
			break; 
		} 
	}
	
	// Serial.printf("rmrootfsprefix=%s",filename[i]); /*spuggy0919*/
	return &filename[i];
}
#endif

/* 
 *	filesystem starter for SPIFFS and SD on ESP, ESP32 and Arduino plus LittleFS
 *	the verbose option needs to be checked 
 * 
 * if SDPIN is empty it is the standard SS pin of the platfrom
 * 
 */
void fsbegin(char v) {
#ifdef ARDUINOSD 
#ifndef SDPIN
#define SDPIN
#endif
  if (SD.begin(SDPIN) && v) outsc("SDcard ok \n"); else outsc("SDcard not ok \n");	
#endif
#if defined(ESPSPIFFS) && defined(ARDUINO_ARCH_ESP8266) 
 	if (SPIFFS.begin() && v) {
		outsc("SPIFFS ok \n");
		FSInfo fs_info;
		SPIFFS.info(fs_info);
		outsc("File system size "); outnumber(fs_info.totalBytes); outcr();
		outsc("File system used "); outnumber(fs_info.usedBytes); outcr();
 	}
#endif
#if defined(ESPLITTLEFS)  /* spuggy0919 */
	Serial.println("fsbegin"); /*spuggy0919*/
 	//if (LittleFS.begin(FORMAT_LITTLEFS_IF_FAILED) && v) {
		Serial.printf("success %d,%d\n",LittleFS.totalBytes(),LittleFS.usedBytes());
	
		// outsc("LittleFS ok \n");
		// outsc("File system size "); outnumber(LittleFS.totalBytes()); outcr();
		// outsc("File system used "); outnumber(LittleFS.usedBytes()); outcr();
 	//}

#endif
#if defined(ESPSPIFFS) && defined(ARDUINO_ARCH_ESP32) 
 	if (SPIFFS.begin() && v) {
		outsc("SPIFFS ok \n"); outcr();
 	}
#endif
#ifdef RP2040LITTLEFS
	myFS = new LittleFS_MBED();
	if (myFS->init() && v) outsc("LittleFS ok \n");
#endif
#ifdef ARDUINOEFS
	int s=EFS.begin();
	if (s>0 && v) {
		outsc("Mounted EFS with "); outnumber(s); outsc(" slots.\n"); 
	} else {
		if (EFS.format(32) && v) outsc("EFS: formating 32 slots.\n");
	}
#endif
}

int fsstat(char c) { 
#if defined(FILESYSTEMDRIVER)
  if (c == 0) return 1;
#endif
  return 0;
}

/*
 *	File I/O function on an Arduino
 * 
 * filewrite(), fileread(), fileavailable() as byte access
 * open and close is handled separately by (i/o)file(open/close)
 * only one file can be open for write and read at the same time
 */
void filewrite(char c) {
#if defined(ARDUINOSD) || defined(ESPSPIFFS) || defined(ESPLITTLEFS) /*spuggy0919*/
	// Serial.printf("fwrite[%2x]%c\n",c,c); 
	if (ofile) ofile.write(c); else ert=1;
#endif
#if defined(RP2040LITTLEFS)
	if (ofile) fputc(c, ofile); else ert=1;
#endif
#if defined(ARDUINOEFS)
	if (ofile) { 
    if (!EFS.fputc(c, ofile)) ert=-1; 
  } else ert=1;
#endif
}

char fileread(){
	char c;
#if defined(ARDUINOSD) || defined(ESPSPIFFS) || defined(ESPLITTLEFS) /*spuggy0919*/

	if (ifile) c=ifile.read(); else { ert=1; return 0; }
	if (c == -1 ) ert=-1;
	if (c == 0xff ) ert=-1; /* spuggy0919 EOF BUG ? S=0*/
	// Serial.printf("fileread[%2x]%c ert=%d\n",c,c,ert);

	return c;
#endif
#ifdef RP2040LITTLEFS
	if (ifile) c=fgetc(ifile); else { ert=1; return 0; }
	if (c == -1 ) ert=-1;
	return c;
#endif
#ifdef ARDUINOEFS
	if (ifile) c=EFS.fgetc(ifile); else { ert=1; return 0; }
	if (c == -1 ) ert=-1;
	return c;
#endif
	return 0;
}

int fileavailable(){
#if defined(ARDUINOSD) || defined(ESPSPIFFS) || defined(ESPLITTLEFS) /*spuggy0919*/
	//  Serial.printf("fileavailable[%4x]\n",ifile.available());
	int len = ifile.available();
	if (len == 0) { ert=-1;}  /*EOF BUG? Spuggy0919*/
	return len;
#endif
#ifdef RP2040LITTLEFS
	return !feof(ifile);
#endif
#ifdef ARDUINOEFS
	return EFS.available(ifile);
#endif
	return 0;
}

char ifileopen(const char* filename){
#ifdef ARDUINOSD
	ifile=SD.open(mkfilename(filename), FILE_READ);
	return (int) ifile;
#endif
#if defined(ESPLITTLEFS) /*spuggy0919*/
	ifile=LittleFS.open(mkfilename(filename));
	Serial.printf("ifileopen[%4x]\n",ifile);

	return (int) ifile;
#endif
#if defined(ESPSPIFFS) 
	ifile=SPIFFS.open(mkfilename(filename), "r");
	return (int) ifile;
#endif
#ifdef RP2040LITTLEFS
	ifile=fopen(mkfilename(filename), "r");
	return (int) ifile;
#endif
#ifdef ARDUINOEFS
	ifile=EFS.fopen(filename, "r");
	return (int) ifile;
#endif
	return 0;
}

void ifileclose(){
#if defined(ARDUINOSD) || defined(ESPSPIFFS) || defined(ESPLITTLEFS) /*spuggy0919*/
	Serial.printf("ifileclose[%4x]\n",ifile);
	ifile.close();
#endif	
#ifdef RP2040LITTLEFS
	if (ifile) fclose(ifile);
	ifile=NULL;	
#endif
#ifdef ARDUINOEFS
	if (ifile) EFS.fclose(ifile);
	ifile=0;	
#endif
}

char ofileopen(char* filename, const char* m){
#ifdef ARDUINOSD
	if (*m == 'w') ofile=SD.open(mkfilename(filename), FILE_OWRITE);
	if (*m == 'a') ofile=SD.open(mkfilename(filename), FILE_WRITE);
	return (int) ofile;
#endif
#if  defined(ESPLITTLEFS) /*spuggy0919*/
	ofile=LittleFS.open(mkfilename(filename),m,true);
	Serial.printf("ofileopen[%4x]\n",ofile);
	return (int) ofile;
#endif
#if  defined(ESPSPIFFS) 
	ofile=SPIFFS.open(mkfilename(filename), m);
	return (int) ofile;
#endif
#ifdef RP2040LITTLEFS
	ofile=fopen(mkfilename(filename), m);
	return (int) ofile; 
#endif
#ifdef ARDUINOEFS
	ofile=EFS.fopen(filename, m);
	return (int) ofile; 
#endif
	return 0;
}

void ofileclose(){
#if defined(ARDUINOSD) || defined(ESPSPIFFS) || defined(ESPLITTLEFS) /*spuggy0919*/
	Serial.printf("ofileclose[%4x]\n",ofile);
    ofile.close();
#endif
#ifdef RP2040LITTLEFS
	if (ofile) fclose(ofile); 
#endif
#ifdef ARDUINOEFS
	if (ofile) EFS.fclose(ofile); 
#endif	
}

/*
 * directory handling for the catalog function
 * these methods are needed for a walkthtrough of 
 * one directory
 *
 * rootopen()
 * while rootnextfile()
 * 	if rootisfile() print rootfilename() rootfilesize()
 *	rootfileclose()
 * rootclose()
 */
void rootopen() {
#ifdef ARDUINOSD
	root=SD.open("/");
#endif
#ifdef ESPLITTLEFS
	root=LittleFS.open("/basic/"); /*spuggy0919***/
	Serial.printf("rootopen[%4x]%s\n",root,root.name());

#endif
#ifdef ESPSPIFFS
#ifdef ARDUINO_ARCH_ESP8266
	root=SPIFFS.openDir("/");
#endif
#ifdef ARDUINO_ARCH_ESP32
	root=SPIFFS.open("/");
#endif
#endif
#ifdef RP2040LITTLEFS
	root=opendir(rootfsprefix);
#endif
#ifdef ARDUINOEFS
	EFS.dirp=0;
#endif	
}

