spuggy0919/ESP32_tinyConsole/lib/Tinybasic/hardware-arduino-HTTP.h
int rootnextfile() {
#ifdef ARDUINOSD 
	file=root.openNextFile();
	return (file != 0);
#endif
#ifdef ESPLITTLEFS /*spuggy0919*/
	file=root.openNextFile();
	// if (file) {
	// 	Serial.printf("openNextFile[%4x]\n",file);
	// 	Serial.printf("name=%s,size=%d,isDir%s\n",file.name(),file.size(),(file.isDirectory())?"Yes":"NO");
	// }
	return (file != 0);
#endif
#ifdef ESPSPIFFS
#ifdef ARDUINO_ARCH_ESP8266
  	if (root.next()) {
    	file=root.openFile("r");
    	return 1;
  	} else {
    	return 0;
	}
#endif
#ifdef ARDUINO_ARCH_ESP32
	file=root.openNextFile();
	return (file != 0);
#endif
#endif
#ifdef RP2040LITTLEFS
	file = readdir(root);
	return (file != 0);
#endif
#ifdef ARDUINOEFS
	file = EFS.readdir();
	return (file != 0);
#endif
  return FALSE;
}

int rootisfile() {

#ifdef ARDUINOSD
	return (! file.isDirectory());
#endif
#ifdef ESPLITTLEFS /*spuggy0919*/
	return (! file.isDirectory());
#endif
#ifdef ESPSPIFFS 
#if defined(ARDUINO_ARCH_ESP8266) 
	return TRUE;
#endif
#if defined(ARDUINO_ARCH_ESP32) 
	Serial.printf("rootisfile[%4x]\n",file);
	Serial.printf("name=%s,size=%d,isDir(%s)\n",file.name(),file.size(),((file.isDirectory())?"true":"false"));
	return (! file.isDirectory());
#endif
#endif
#ifdef RP2040LITTLEFS
	return (file->d_type == DT_REG);
#endif
#ifdef ARDUINOEFS
	return true;
#endif	
	return FALSE;
}

const char* rootfilename() {
#ifdef ARDUINOSD
	//return (char*) file.name();
 return rmrootfsprefix(file.name());
#endif
#ifdef ESPLITTLEFS
	// Serial.printf("name=%s,size=%d,isDir(%s)\n",file.name(),file.size(),((file.isDirectory())?"true":"false"));

	const char * fname = rmrootfsprefix(file.name());
	// Serial.printf("rmrootfsprefix(%s)\n",fname);
 return fname;
#endif 
#ifdef ESPSPIFFS
#ifdef ARDUINO_ARCH_ESP8266
	// c_str() and copy - real ugly
  int i=0;
	String s=root.fileName();
 	for (i=0; i<s.length(); i++) { tempname[i]=s[i]; }
 	tempname[i]=0;
	return rmrootfsprefix(tempname);
#endif
#ifdef ARDUINO_ARCH_ESP32
	return rmrootfsprefix(file.name());
#endif
#endif
#ifdef RP2040LITTLEFS
	return (file->d_name);
#endif
#ifdef ARDUINOEFS
	return EFS.filename(file);
#endif
	return FALSE; 
}

int rootfilesize() {
#if defined(ARDUINOSD) || defined(ESPSPIFFS) || defined(ESPLITTLEFS)
  return file.size();
#endif  
#ifdef RP2040LITTLEFS
#endif
#ifdef ARDUINOEFS
	return EFS.filesize(file);
#endif
  return 0;
}

void rootfileclose() {
#if defined(ARDUINOSD) || defined(ESPSPIFFS) || defined(ESPLITTLEFS) /*spuggy0919*/
		// Serial.printf("rootfileclose[%4x]name=%s\n",file,file.name());
  		file.close();
#endif 
#ifdef RP2040LITTLEFS
#endif
#ifdef ARDUINOEFS
#endif
}

void rootclose(){
#ifdef ARDUINOSD
  root.close();
#endif
#ifdef ESPLITTLEFS /*spuggy0919*/
		// Serial.printf("rootfileclose[%4x],name=%s\n",root,root.name());
  root.close();
#endif
#if defined(ESPSPIFFS) && defined(ESPLITTLEFS) /*spuggy0919*/
#ifdef ARDUINO_ARCH_ESP8266
  return;
#endif
#ifdef ARDUINO_ARCH_ESP32
  root.close();
#endif
#endif
#ifdef RP2040LITTLEFS
#endif
#ifdef ARDUINOEFS
#endif
}

/*
 * remove method for files
 */
void removefile(char *filename) {
#ifdef ARDUINOSD	
	SD.remove(filename);
	return;
#endif
#ifdef ESPSPIFFS
	SPIFFS.remove(mkfilename(filename));
	return;
#endif
#ifdef ESPLITTLEFS  /* spuggy0919 */
	LittleFS.remove(mkfilename(filename));
	return;
#endif
#ifdef RP2040LITTLEFS
	remove(mkfilename(filename));
	return;
#endif
#ifdef ARDUINOEFS
	EFS.remove(filename);
	return;
#endif
}

/*
 * formatting for fdisk of the internal filesystems
 */
void formatdisk(short i) {
#ifdef ARDUINOSD	
	return;
#endif
#ifdef ESPSPIFFS
	if (SPIFFS.format()) { SPIFFS.begin(); outsc("ok\n"); } else { outsc("fail\n"); }
#endif
#ifdef ESPLITTLEFS
	return ; // not support now. spuggy0919
#endif
#ifdef RP2040LITTLEFS
  fs.reformat(&bd);
	return;
#endif
#ifdef ARDUINOEFS
	if (i>0 && i<256) {
		if (EFS.format(i)) { EFS.begin(); outsc("ok\n"); } else { outsc("fail\n"); }
		outcr();
	} else error(EORANGE);
	return;
#endif
}

/*
 *	Primary serial code uses the Serial object or Picoserial
 *
 *	Picoserial has an own input buffer and an 
 *	interrupt function. This is used to fill the input buffer 
 *	directly on read. Write is standard like in the Serial code.
 */
#ifdef USESPICOSERIAL
volatile static char picochar;
volatile static char picoa = FALSE;
volatile static char* picob = NULL;
static short picobsize = 0;
volatile static short picoi = 1;

/* getchar */
void picogetchar(int c){
	if (picob && (! picoa) ) {
    	picochar=c;
		if (picochar != '\n' && picochar != '\r' && picoi<picobsize-1) {
			picob[picoi++]=picochar;
			outch(picochar);
		} else {
			picoa = TRUE;
			picob[picoi]=0;
			picob[0]=picoi;
			z.a=picoi;
			picoi=1;
		}
		picochar=0; /* every buffered byte is deleted */
	} else {
    	if (c != 10) picochar=c;
	}
}
#endif
#ifdef HTTPWSSERIAL  /*spuggy0919*/
#include "wsSerial.h"
#include "WebServer.h"
#endif 
/* 
 * blocking serial single char read for Serial
 * unblocking for Picoserial because it is not 
 * character oriented -> consins.
 */
char serialread() {
#ifdef USESPICOSERIAL
	char c;
	c=picochar;
	picochar=0;
	return c;	
#elif defined(HTTPWSSERIAL) /*spuggy0919*/
    char c;
    // while (!_d_isrxavailable())   yield(); // may be deadlock **WARNING **
    // _d_fetchrxdata(&c);
    while (!wsSerial.available())   byield(); // may be deadlock **WARNING **
	c = wsSerial.read();  	
	// Serial.printf("basic<WS[%2x]%c\n",c,c);   /*spuggy0919*/
    return c;

#else
	while (!Serial.available()) byield();
	return Serial.read();
#endif
}

/*
 *  serial begin code with a one second delay after start
 *	this is not needed any more 
 */
void serialbegin() {
#ifdef USESPICOSERIAL
	(void) PicoSerial.begin(serial_baudrate, picogetchar); 
#elif defined(HTTPWSSERIAL)
	// stdioRedirector(); //alreaedy start on main setup
		wsSerial.begin();
	///Serial.begin(115200);
  //while(!Serial) byield();
#endif
	delay(1000);
}

/* state information on the serial port */
int serialstat(char c) {
  if (c == 0) return 1;
  if (c == 1) return serial_baudrate;
  return 0;
}

/* write to a serial stream */
void serialwrite(char c) {

  	wsSerial.write(c);
	if (c=='\n') {yield();}

#ifdef HASMSTAB
  if (c > 31) charcount+=1;
  if (c == 10) charcount=0;
#endif
}

