spuggy0919/ESP32_tinyConsole/lib/Tinybasic/hardware-arduino-HTTP.h
/* check on a character, needed for breaking */
short serialcheckch() {
	// Serial.printf("sck");  
	
	// if (_d_isrxavailable()) {
	// 	char c =  _d_GetPeek();
	// 	//   Serial.printf("peek[%2x]%c\n",c,c);  

	// 	return c;
	// }
	// Serial.printf("sck");  
  	if (wsSerial.available()) {
  		// char c =  _d_GetPeek();
 		char c = wsSerial.peek();
  		//   Serial.printf("peek[%2x]%c\n",c,c);  
		return c;
	}

	return 0;

}

/* avail method, needed for AVAIL() */ 
short serialavailable() {
	// short i = _d_isrxavailable();
	short i = wsSerial.available();
	//   Serial.printf("ava[%2x]%c\n",i,i);  
	  return i;

}

/*
 * reading from the console with inch or the picoserial callback
 * this mixes interpreter levels as inch/outch are used here 
 * this code needs to go to the main interpreter section after 
 * thorough rewrite
 */
void consins(char *b, short nb) {
	char c;
 
	z.a = 1;
#ifdef USESPICOSERIAL
	if (id == ISERIAL) {
		picob=b;
		picobsize=nb;
		picoa=FALSE;
		while (! picoa);
		//outsc(b+1); 
		outcr();
		return;
	}
#endif
	while(z.a < nb) {
  		c=inch(); 
		// Serial.printf("consins[%2x]%c\n",c,c); /*spuggy0919*/
  		if (id == ISERIAL || id == IKEYBOARD){
			// outch(c); /*spuggy0919*/ no need to echo command
			// Serial.printf("id==ISERIAL[%2x]%c\n",c,c); /*spuggy0919*/
		} 
		if (c == '\x03' || c == '\x1b') { /*spuggy0919 for exit interactive mode*/
			b[z.a++]=c; break;
		}

  		if (c == '\r') c=inch(); 			/* skip carriage return */
  		if (c == '\n' || c == -1) { 	/* terminal character is either newline or EOF */
    		outch(c);break; //spuggy0919 for new line prompt
  		} else if ( (c == 127 || c == 8) && z.a>1) {
   			z.a--;  /* TBD for utf8 del spuggy0919*/
  		} else {
   			b[z.a++]=c;
  		} 
	}
	b[z.a]=0;
	z.a--;
  b[0]=(unsigned char)z.a; 
}
/* 
 * Start a secondary serial port for printing and/or networking 
 * This is either Serial1 on a MEGA or DUE or Nano Every or a SoftwareSerial 
 * instance
 */
#ifdef ARDUINOPRT
#if !defined(ARDUINO_AVR_MEGA2560) && !defined(ARDUINO_SAM_DUE) && !defined(ARDUINO_AVR_NANO_EVERY) && !defined(ARDUINO_NANO_RP2040_CONNECT) && !defined(ARDUINO_RASPBERRY_PI_PICO)
#include <SoftwareSerial.h>
/* definition of the serial port pins from "pretzel board"
for UNO 11 is not good for rx */
const int software_serial_rx = SOFTSERIALRX;
const int software_serial_tx = SOFTSERIALTX;
SoftwareSerial Serial1(software_serial_rx, software_serial_tx);
#endif

/* second serial port */
void prtbegin() {
	Serial1.begin(serial1_baudrate);
}

int prtstat(char c) {
  if (c == 0) return 1;
  if (c == 1) return serial1_baudrate;
  return 0;
}

void prtwrite(char c) {
	Serial1.write(c);
}

char prtread() {
	while (!Serial1.available()) byield();
	return Serial1.read();
}

short prtcheckch() {
	if (Serial1.available()) return Serial1.peek(); else return 0;
}

short prtavailable() {
	return Serial1.available();
}

void prtset(int s) {
  serial1_baudrate=s;
  prtbegin();
}
#endif


/* 
 * The wire code, direct access to wire communication
 * in master mode wire_slaveid is the I2C address bound 
 * to channel &7 and wire_myid is 0
 * in slave mode wire_myid is the devices slave address
 * and wire_slaveid is 0
 * ARDUINOWIREBUFFER is the maximum length of meesages the 
 * underlying library can process. This is 32 for the Wire
 * library
 */ 

#ifdef ARDUINOWIRE
uint8_t wire_slaveid = 0;
uint8_t wire_myid = 0;
#define ARDUINOWIREBUFFER 32
#ifdef ARDUINOWIRESLAVE
char wirereceivebuffer[ARDUINOWIREBUFFER];
short wirereceivechars = 0;
char wirerequestbuffer[ARDUINOWIREBUFFER];
short wirerequestchars = 0;
#endif

/* default begin is as a master */
void wirebegin() {
#ifndef SDA_PIN   
	Wire.begin();
#else
  Wire.begin(SDA_PIN, SCL_PIN);
#endif
}

void wireslavebegin(char s) {
#ifndef SDA_PIN
  Wire.begin(s);
#else
  Wire.begin(SDA_PIN, SCL_PIN, s);
#endif
}

/* wire status - just checks if wire is compiled */
int wirestat(char c) {
  switch (c) {
    case 0: 
      return 1;
#ifdef ARDUINOWIRESLAVE
    case 1:
      return wirerequestchars;
#endif    
    default:
      return 0;
  }
}

/* available characters - test code ecapsulation prep for slave*/
short wireavailable() {
/* as a master we return 1, as a slave the received chars*/
  if (wire_myid == 0) return 1;
#ifdef ARDUINOWIRESLAVE
  else return wirereceivechars; 
#endif
  return 0;
}

#ifdef ARDUINOWIRESLAVE
/* event handler for receive */
void wireonreceive(int h) {
  wirereceivechars=h;
  if (h>ARDUINOWIREBUFFER) h=ARDUINOWIREBUFFER;
  for (int i=0; i<h; i++) wirereceivebuffer[i]=Wire.read();
}

/* event handler for request, deliver the message and forget the buffer */ 
void wireonrequest() {
  Wire.write(wirerequestbuffer, wirerequestchars);
  wirerequestchars=0;
}
#endif

/*
 *	as a master open sets the slave id for the communication
 *	no extra begin while we stay master
 */
void wireopen(char s, char m) {
	if (m == 0) {
		wire_slaveid=s;
/* we have been a slave and become master, restart wire*/
    if (wire_myid != 0) {
      wirebegin();
      wire_myid=0;    
    }
	} else if ( m == 1 ) { 
		wire_myid=s;
		wire_slaveid=0;
#ifdef ARDUINOWIRESLAVE
		wireslavebegin(wire_myid);
    Wire.onReceive(&wireonreceive);
    Wire.onRequest(&wireonrequest);
#endif
	} else 
		error(EORANGE);
}

/* input an entire string */
void wireins(char *b, uint8_t l) {
  if (wire_myid == 0) {
    z.a=0;
    if (l>ARDUINOWIREBUFFER) l=ARDUINOWIREBUFFER;
    if (!Wire.requestFrom(wire_slaveid, l)) ert=1;
    while (Wire.available() && z.a<l) b[++z.a]=Wire.read();
  } else {
#ifdef ARDUINOWIRESLAVE
    for (z.a=0; z.a<wirereceivechars && z.a<l; z.a++) b[z.a+1]=wirereceivebuffer[z.a];
    wirereceivechars=0; /* clear the entire buffer on read, bytewise read not really supported */
#endif
  }
  b[0]=z.a;
}

/* send an entire string - truncate radically */
void wireouts(char *b, uint8_t l) {
  if (l>ARDUINOWIREBUFFER) l=ARDUINOWIREBUFFER; 
  if (wire_myid == 0) {
    Wire.beginTransmission(wire_slaveid); 
#ifdef ARDUINO_ARCH_ESP32
    for(z.a=0; z.a<l; z.a++) Wire.write(b[z.a]);  
#else
    Wire.write(b, l);
#endif
    ert=Wire.endTransmission(); 
  } else {
#ifdef ARDUINOWIRESLAVE
    for (int i=0; i<l; i++) wirerequestbuffer[i]=b[i];
    wirerequestchars=l;
#endif
  }
}
#else
void wirebegin() {}
int wirestat(char c) {return 0; }
void wireopen(char s, char m) {}
void wireins(char *b, uint8_t l) { b[0]=0; z.a=0; }
void wireouts(char *b, uint8_t l) {}
short wireavailable() { return 0; }
#endif
/* 
 *	Read from Touch panel, the coordinate is input string number
 *
 */
#ifdef HTTPWSTOUCH
#include "port/itouch.h"
//extern TouchQueue gTouchQueue;

#else
void touchbegin() {}
int touchstat(char c) {return 0; }
void touchopen(char s, char m) {}
void touchins(char *b, uint8_t l) { b[0]=0; z.a=0; }
void touchouts(char *b, uint8_t l) {}
short touchavailable() { return 0; }
#endif
/* 
 *	Read from the radio interface, radio is always block 
 *	oriented. This function is called from ins for an entire 
 *	line.
 *
 *	In blockmode the entire message is returned in the 
 *	receiving string while in line mode the length of the 
 *	string is adapted. Blockmode can be used to transfer
 *	binary data.
 */

#ifdef ARDUINORF24
/*
 * definitions for the nearfield module, still very experimental
 * We use the standard RF24 nearfield library 
 */
const char rf24_ce = RF24CEPIN; 
const char rf24_csn = RF24CSNPIN; 
#include <nRF24L01.h>
#include <RF24.h>
rf24_pa_dbm_e rf24_pa = RF24_PA_MAX;
RF24 radio(rf24_ce, rf24_csn);

/* radio status */
int radiostat(char c) {
#if defined(ARDUINORF24)
  if (c == 0) return 1;
  if (c == 1) return radio.isChipConnected();
#endif
  return 0; 
}

/* generate a uint64_t pipe address from the filename string for RF24 */
uint64_t pipeaddr(char * f){
	uint64_t t = 0;
	t=(uint8_t)f[0];
	for(short i=1; i<=4; i++) t=t*256+(uint8_t)f[i];
	return t;
} 
#endif

